//----------------------------------------------
// 2026 1학기 STL 월56 화 78
//----------------------------------------------
// STL 컨테이너 - std::string과 유사한 ZString을 만들어서 컨테이너의 본질에 접근
//----------------------------------------------
#include <iostream>
#include <string>
#include "save.h"
using namespace std;

//--------
int main()
//--------
{
    string s{ "2026" };
    s += "0407";
    cout << s << endl;

    // string을 자료구조처럼 사용하는 것이 가능해짐
    for (auto i{ s.begin() }; i < s.end(); ++i)
        cout << *i << endl;



    // save("메인.cpp");
}